node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
}
node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "output"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "X"
      }
    }
  }
}
node {
  name: "HistogramSummary"
  op: "HistogramSummary"
  input: "HistogramSummary/tag"
  input: "input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y"
      }
    }
  }
}
node {
  name: "HistogramSummary_1"
  op: "HistogramSummary"
  input: "HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/filters"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\003\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.333333343267
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.333333343267
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 14
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/sub"
  op: "Sub"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/max"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform/mul"
  op: "Mul"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/RandomUniform"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Initializer/random_uniform"
  op: "Add"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/mul"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/Assign"
  op: "Assign"
  input: "conv_layer1/convolution/filters"
  input: "conv_layer1/convolution/filters/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/filters/read"
  op: "Identity"
  input: "conv_layer1/convolution/filters"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/filters"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/Conv2D"
  op: "Conv2D"
  input: "input"
  input: "conv_layer1/convolution/filters/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 16
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.019999999553
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 25
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/mul"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/RandomStandardNormal"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal"
  op: "Add"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/mul"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/Assign"
  op: "Assign"
  input: "conv_layer1/convolution/batch_norm/gamma"
  input: "conv_layer1/convolution/batch_norm/gamma/Initializer/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/gamma/read"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/gamma"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/beta"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/beta/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/beta/Assign"
  op: "Assign"
  input: "conv_layer1/convolution/batch_norm/beta"
  input: "conv_layer1/convolution/batch_norm/beta/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/beta/read"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/beta"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape"
  op: "Shape"
  input: "conv_layer1/convolution/Conv2D"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape_1"
  op: "Shape"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/sparse_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/sparse_values"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/default_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense"
  op: "SparseToDense"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/sparse_indices"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape_1"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/sparse_values"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense/default_value"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tindices"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "validate_indices"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like/Shape"
  op: "Shape"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like"
  op: "Fill"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like/Shape"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Select"
  op: "Select"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SparseToDense"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/ones_like"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv/Cast"
  op: "Cast"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Shape"
  attr {
    key: "DstT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv/Cast_1"
  op: "Cast"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Select"
  attr {
    key: "DstT"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv"
  op: "Div"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv/Cast"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv/Cast_1"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Rank"
  op: "Rank"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range"
  op: "Range"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range/start"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Rank"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range/delta"
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Prod"
  op: "Prod"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/truediv"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/range"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/count"
  op: "Cast"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Prod"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_DOUBLE
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/zeros_like"
  op: "ZerosLike"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Select"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Slice"
  op: "Slice"
  input: "conv_layer1/convolution/Conv2D"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/zeros_like"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Select"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Sub"
  op: "Sub"
  input: "conv_layer1/convolution/Conv2D"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SquaredDifference"
  op: "SquaredDifference"
  input: "conv_layer1/convolution/Conv2D"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/shift"
  op: "Squeeze"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
        i: 1
        i: 2
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/mean_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/mean_ss"
  op: "Sum"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/Sub"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/mean_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/var_ss/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\000\000\000\000\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/var_ss"
  op: "Sum"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/SquaredDifference"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/var_ss/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/divisor"
  op: "Inv"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/count"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/shifted_mean"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/mean_ss"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/mean"
  op: "Add"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/shifted_mean"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/shift"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/Mul"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/moments/sufficient_statistics/var_ss"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/divisor"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/Square"
  op: "Square"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/shifted_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/moments/normalize/variance"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/Mul"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/Square"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/zeros"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
  input: "conv_layer1/convolution/batch_norm/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage/read"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/zeros_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage/Assign"
  op: "Assign"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
  input: "conv_layer1/convolution/batch_norm/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage/read"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/decay"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.899999976158
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub/x"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage/read"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/mul"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub_1"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg"
  op: "AssignSub"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub/x"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub_1"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage/read"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/mul"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub_1"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1"
  op: "AssignSub"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
  input: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/ExponentialMovingAverage"
  op: "NoOp"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage/AssignMovingAvg_1"
}
node {
  name: "conv_layer1/convolution/batch_norm/Squeeze/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
          dim {
            size: 1
          }
        }
        bool_val: true
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/Squeeze"
  op: "Squeeze"
  input: "conv_layer1/convolution/batch_norm/Squeeze/input"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Switch"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/Squeeze"
  input: "conv_layer1/convolution/batch_norm/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/switch_t"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/switch_f"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/pred_id"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Identity/Switch"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/mean"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/moments/normalize/mean"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Identity"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/cond/Identity/Switch:1"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Identity_1/Switch"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/moments/normalize/variance"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/moments/normalize/variance"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Identity_1"
  op: "Identity"
  input: "conv_layer1/convolution/batch_norm/cond/Identity_1/Switch:1"
  input: "^conv_layer1/convolution/batch_norm/ExponentialMovingAverage"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Switch_1/Switch"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage/read"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Switch_1"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/cond/Switch_1/Switch"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/mean/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Switch_2/Switch"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage/read"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Switch_2"
  op: "Switch"
  input: "conv_layer1/convolution/batch_norm/cond/Switch_2/Switch"
  input: "conv_layer1/convolution/batch_norm/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@conv_layer1/convolution/batch_norm/conv_layer1/convolution/batch_norm/moments/normalize/variance/ExponentialMovingAverage"
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Merge"
  op: "Merge"
  input: "conv_layer1/convolution/batch_norm/cond/Switch_1"
  input: "conv_layer1/convolution/batch_norm/cond/Identity"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/cond/Merge_1"
  op: "Merge"
  input: "conv_layer1/convolution/batch_norm/cond/Switch_2"
  input: "conv_layer1/convolution/batch_norm/cond/Identity_1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.99999974738e-06
      }
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/add"
  op: "Add"
  input: "conv_layer1/convolution/batch_norm/cond/Merge_1"
  input: "conv_layer1/convolution/batch_norm/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "conv_layer1/convolution/batch_norm/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/mul"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/batchnorm/Rsqrt"
  input: "conv_layer1/convolution/batch_norm/gamma/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/mul_1"
  op: "Mul"
  input: "conv_layer1/convolution/Conv2D"
  input: "conv_layer1/convolution/batch_norm/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/mul_2"
  op: "Mul"
  input: "conv_layer1/convolution/batch_norm/cond/Merge"
  input: "conv_layer1/convolution/batch_norm/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/sub"
  op: "Sub"
  input: "conv_layer1/convolution/batch_norm/beta/read"
  input: "conv_layer1/convolution/batch_norm/batchnorm/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/batch_norm/batchnorm/add_1"
  op: "Add"
  input: "conv_layer1/convolution/batch_norm/batchnorm/mul_1"
  input: "conv_layer1/convolution/batch_norm/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "conv_layer1/convolution/Elu"
  op: "Elu"
  input: "conv_layer1/convolution/batch_norm/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 16
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\020\000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.144337564707
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.144337564707
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 117
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/sub"
  op: "Sub"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/max"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/mul"
  op: "Mul"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/RandomUniform"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform"
  op: "Add"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/mul"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/Assign"
  op: "Assign"
  input: "block_0/layer_0/0/convolution/filters"
  input: "block_0/layer_0/0/convolution/filters/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/filters/read"
  op: "Identity"
  input: "block_0/layer_0/0/convolution/filters"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@block_0/layer_0/0/convolution/filters"
      }
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/Conv2D"
  op: "Conv2D"
  input: "conv_layer1/convolution/Elu"
  input: "block_0/layer_0/0/convolution/filters/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "block_0/layer_0/0/convolution/batch_norm/gamma"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
